[
    {
        "name": "Harry Potter and the Philosopher's Stone",
        "description": "Harry Potter and the Philosopher's Stone (also known as Harry Potter and the Sorcerer's Stone in the United States) is a 2001 fantasy film directed by Chris Columbus and produced by David Heyman, from a screenplay by Steve Kloves, based on the 1997 novel of the same name by J. K. Rowling. It is the first instalment in the Harry Potter film series. The film stars Daniel Radcliffe as Harry Potter, with Rupert Grint as Ron Weasley, and Emma Watson as Hermione Granger. Its story follows Harry's first year at Hogwarts School of Witchcraft and Wizardry as he discovers that he is a famous wizard and begins his formal wizarding education.",
        "rating": 7.1,
        "genre": "Fantasy",
        "actors": [
            "Daniel Radcliffe",
            "Rupert Grint",
            "Emma Watson",
            "John Cleese",
            "Robbie Coltrane",
            "Warwick Davis",
            "Richard Griffiths",
            "Richard Harris",
            "Ian Hart",
            "John Hurt",
            "Alan Rickman",
            "Fiona Shaw",
            "Maggie Smith",
            "Julie Walters"
        ],
        "poster": "https://upload.wikimedia.org/wikipedia/en/7/7a/Harry_Potter_and_the_Philosopher%27s_Stone_banner.jpg"
    },
    {
        "name": "Garfield: The Movie",
        "description": "Garfield: The Movie is a 2004 American comedy film based on Jim Davis' comic strip Garfield. Directed by Peter Hewitt and written by Joel Cohen and Alec Sokolow, it stars Breckin Meyer as Jon Arbuckle, Jennifer Love Hewitt as Dr. Liz Wilson and features Bill Murray as the voice of Garfield, who was created with computer-generated imagery.",
        "rating": 3.52,
        "genre": "Fantasy",
        "actors": [
            "Breckin Meyer",
            "Jennifer Love Hewitt",
            "Stephen Tobolowsky",
            "Bill Murray"
        ],
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/e/eb/Garfield_ver6.jpg/220px-Garfield_ver6.jpg"
    },
    {
        "name": "Повстання Штатів",
        "description": "«Повстання Штатів»[6] (англ. Civil War, дослівний переклад: Громадянська війна) — британсько-американський антиутопічний воєнний бойовик сценариста і режисера Алекса Ґарленда. У головних ролях Кірстен Данст, Вагнер Моура, Кейлі Спейні, Стівен Гендерсон і Нік Офферман.\n\nПісля політичної кризи частина штатів проголошують свою незалежність і ведуть війська на Вашингтон. Американський уряд вирішує придушити повстання. За подіями спостерігає команда журналістів, прямуючи до Вашингтона, щоб взяти в президента інтерв'ю.",
        "rating": 7.6,
        "genre": "бойовик",
        "actors": [
            "Кірстен Данст[2]",
            "Ваґнер Моура[2]",
            "Stephen McKinley Hendersond[2]",
            "Кейлі Спейні[2]",
            "Карл Ґлусман[2]",
            "Соноя Мідзуно[2]",
            "Джоніка Т. Гіббсd[2]",
            "Джессі Племенс[2]",
            "Нік Офферман[2]",
            "Jefferson Whited[2]",
            "Juani Felizd[2]",
            "Nelson Leed[2]",
            "Edmund Donovand[2]",
            "Jin Had[2]",
            "Evan Laid[2]",
            "Greg Hilld"
        ],
        "poster": "https://upload.wikimedia.org/wikipedia/uk/0/08/Civil_War_2024_film_poster.jpg"
    }
]